{
    "footer": "© 2022-2022 Angular.com / All rights reserved.",
    "hello": "Hello",
    "logOut": "log out",
    "logIn": "Log in",
    "solution": "Solution?",
    "interpolation": "{{ interpolation }}",
    "note": "Note:",
    "introduction": "Introduction",
    "start": "START",
    "back": "back",
    "next": "advance",
    "camouflage": "camouflage",
    "pressurization": "pressurization",
    "hatch": "hatch",
    "activated": "ACTIVATED",
    "disabled": "DISABLED",

    "title-home": "Study Angular in a fun way",
    "subtitle-first-home": "No more boring courses, videos and articles.",
    "subtitle-second-home": "Learn to code in a new, fun and effective way.",
    "button-play-home": "Play and Learn Angular",
    "button-subtitle-home": "Join 2+ people who started playing",
    "title-two-problem": "Traditional learning has TWO BIG PROBLEMS",
    "title-first-problem": "Problem #1: Lack of practice",
    "paragraph-one-first-problem": "According to neuroscience research, the essential thing in learning is practice. The more we practice, the more effectively our brain stores learned information for later access. However, traditional learning is the opposite of practice.",
    "paragraph-two-first-problem": "How many times have you opened a code editor and started coding after watching another coding tutorial? Probably not enough. But the problem is not with you. It's the way you learn.",
    "paragraph-three-first-problem": "Encoded videos are designed to be consumed like TV shows. As a result, all the hours spent \"learning\" turn into hours spent \"observing the theory\". And only theory without practice leads to unproductive learning. Especially when learning to code.",
    "title-second-problem": "Problem #2: Low engagement",
    "paragraph-one-second-problem": "According to neuroscience research, we need to ensure that learning is engaging and taps into the emotional side of the brain, through humor, storytelling and games. Emphasis on the rational and logical alone does not produce strong memories.",
    "paragraph-two-second-problem": "And do you remember the last time you watched a coding tutorial or read an article that wasn't boring? Hard to remember at once, right? That's because most educational content is boring.",
    "paragraph-three-second-problem": "Boredom leads to lack of focus and procrastination, which prevents you from staying engaged and remembering everything you've learned.",
    "subtitle-solution": "Combine tons of practice with an engaging, interactive environment where you learn by doing.",
    "title-mission": "Our mission",
    "subtitle-mission": "Making code learning more efficient, interesting and fun.",
    "paragraph-one-mission": "Hello, my name is Jackson. I am the founder of Angular Fantasy. I have been programming for over 7 years and have learned to code using traditional methods.",
    "paragraph-two-mission": "I remember those days. How many times have I forced myself to sit down and learn to program. How boring articles and documentation seemed to me. How much practice I lacked and because of that knowledge quickly disappeared. Learning shouldn't be like this, so I decided to change.",
    "paragraph-three-mission": "I started with the fundamentals and studied how our brains learn. Neuroscience says that effective learning requires (1) a lot of practice and (2) a sense that learning is engaging. Exactly what is often overlooked in traditional ways of learning. Exactly why I had difficulty learning to program. And exactly what needed to be changed.",
    "paragraph-four-mission": "I created Angular Fantasy as a new and more efficient way to learn code. Games are one of the best combinations of (1) practice and (2) an engaging learning environment. They are the next logical step from traditional education. They are the future of learning. And my mission and mission of Angular Fantasy is to make that future our reality.",
    "title-fourth-container": "Ready to start your adventure?",

    "paragraph-example-game-home": "Use an interpolation describing \"{{ interpolation }}\" in the field below.",
    "paragraph-game-home": "Text interpolation lets you embed dynamic string values in your HTML templates. Use tweening to dynamically change what appears in an app preview, such as displaying a custom greeting that includes a \"Hello World\".",

    "season-first": "First season",
    "season-second": "Second season",
    "start-adventure": "Start adventure",
    "text-introduction": "This story takes place in the year 2325, where interplanetary travel is increasingly common.",
    "text-introduction-second": "With the shocking news that a metallic sphere appeared on Mars, you had the idea of building a ship to travel between the planets and be able to create content for your channel. It seemed crazy, because to carry out an interplanetary trip it takes many hours of study and knowledge in the area of technology.",
    "text-introduction-third": "After countless hours watching “How to get to Mars” on Youtube and an extensive manual in pdf, you came to the conclusion that it would not be possible to carry out this mission alone. When remembering that his friend, besides being an excellent programmer, is an enthusiast for Mars, he decided to tell him about the news and ask for help. After many challenges to build the ship you succeeded, and decided that the operating system would be in Angular. From that moment your adventure begins!",
    "text-season-first": "After 70 million kilometers traveled, we finally entered the orbit of Mars, but after going through a geomagnetic storm your friend who was in charge of the spacecraft is unconscious, and now what? Even without knowing angular, you will need to take command of the ship, for that we will count on the help of our artificial intelligence (AI), \"bilu\".",
    "close": "close",
    "what-is-ternary": "What is ternary?"
}
