{
    "footer": "© 2022-2022 Angular.com / Todos los derechos reservados.",
    "hello": "Hola",
    "logOut": "salir",
    "logIn": "Iniciar",
    "solution": "¿Solución?",
    "interpolation": "{{ interpolation }}",
    "note": "Nota:",
    "introduction": "Introducion",
    "start": "COMIENZO",
    "back": "regresar",
    "next": "ventaja",
    "camouflage": "camuflaje",
    "pressurization": "presurización",
    "hatch": "escotilla",
    "activated": "ACTIVADO",
    "disabled": "DESACTIVADO",

    "title-home": "Estudia Angular de forma divertida",
    "subtitle-first-home": "No más cursos, videos y artículos aburridos.",
    "subtitle-second-home": "Aprende a codificar de una manera nueva, divertida y efectiva.",
    "button-play-home": "Juega y Aprende Angular",
    "button-subtitle-home": "Únete a más de 2 personas que comenzaron a jugar",
    "title-two-problem": "El aprendizaje tradicional tiene DOS GRANDES PROBLEMAS",
    "title-first-problem": "Problema #1: Falta de práctica",
    "paragraph-one-first-problem": "Según investigaciones en neurociencia, lo esencial en el aprendizaje es la práctica. Cuanto más practicamos, más eficazmente nuestro cerebro almacena la información aprendida para su posterior acceso. Sin embargo, el aprendizaje tradicional es lo opuesto a la práctica.",
    "paragraph-two-first-problem": "¿Cuántas veces ha abierto un editor de código y ha comenzado a codificar después de ver otro tutorial de codificación? Probablemente no lo suficiente. Pero el problema no es contigo. Es la forma en que aprendes.",
    "paragraph-three-first-problem": "Los videos codificados están diseñados para ser consumidos como programas de televisión. Como resultado, todas las horas dedicadas a \"aprender\" se convierten en horas dedicadas a \"observar la teoría\". Y solo la teoría sin la práctica conduce a un aprendizaje improductivo. Especialmente cuando se aprende a codificar.",
    "title-second-problem": "Problema #2: Bajo compromiso",
    "paragraph-one-second-problem": "De acuerdo con la investigación en neurociencia, debemos asegurarnos de que el aprendizaje sea atractivo y aproveche el lado emocional del cerebro, a través del humor, la narración de historias y los juegos. El énfasis en lo racional y lógico por sí solo no produce recuerdos fuertes.",
    "paragraph-two-second-problem": "¿Y recuerdas la última vez que viste un tutorial de codificación o leíste un artículo que no era aburrido? Difícil de recordar a la vez, ¿verdad? Eso es porque la mayoría del contenido educativo es aburrido.",
    "paragraph-three-second-problem": "El aburrimiento conduce a la falta de concentración y a la procrastinación, lo que le impide mantenerse comprometido y recordar todo lo que ha aprendido.",
    "subtitle-solution": "Combine toneladas de práctica con un entorno atractivo e interactivo donde aprende haciendo.",
    "title-mission": "Nuestra misión",
    "subtitle-mission": "Hacer que el aprendizaje del código sea más eficiente, interesante y divertido.",
    "paragraph-one-mission": "Hola, mi nombre es Jackson. Soy el fundador de Angular Fantasy. He estado programando por más de 7 años y he aprendido a codificar usando métodos tradicionales.",
    "paragraph-two-mission": "Recuerdo esos días. Cuantas veces me he obligado a sentarme y aprender a programar. Que aburridos me parecieron los artículos y la documentación. Cuanta práctica me faltó y por eso el conocimiento desapareció rápidamente. El aprendizaje no debería ser así, así que decidí cambiar.",
    "paragraph-three-mission": "Empecé con los fundamentos y estudié cómo aprenden nuestros cerebros. La neurociencia dice que el aprendizaje efectivo requiere (1) mucha práctica y (2) una sensación de que el aprendizaje es atractivo. Exactamente lo que a menudo se pasa por alto en las formas tradicionales de aprendizaje. Exactamente por qué tuve dificultades para aprender a programar. Y exactamente lo que necesitaba ser cambiado.",
    "paragraph-four-mission": "Creé Angular Fantasy como una forma nueva y más eficiente de aprender código. Los juegos son una de las mejores combinaciones de (1) práctica y (2) un entorno de aprendizaje atractivo. Son el siguiente paso lógico de la educación tradicional. Ellos son el futuro del aprendizaje. Y mi misión y misión de Angular Fantasy es hacer de ese futuro nuestra realidad.",
    "title-fourth-container": "¿Listo para comenzar tu aventura?",

    "paragraph-example-game-home": "Use una interpolación que describa \"{{interpolación }}\" en el campo a continuación.",
    "paragraph-game-home": "La interpolación de texto le permite incrustar valores de cadena dinámicos en sus plantillas HTML. Utilice la interpolación para cambiar dinámicamente lo que aparece en la vista previa de una aplicación, como mostrar un saludo personalizado que incluya un \"Hola mundo\".",

    "season-first": "Primera temporada",
    "season-second": "Segunda temporada",
    "start-adventure": "Aventura iniciaria",
    "text-introduction": "Esta historia tiene lugar en el año 2325, donde los viajes interplanetarios son cada vez más comunes.",
    "text-introduction-second": "Con la impactante noticia de que apareció una esfera metálica en Marte, tuviste la idea de construir una nave para viajar entre los planetas y poder crear contenido para tu canal. Parecía una locura, pues para realizar un viaje interplanetario se necesitan muchas horas de estudio y conocimientos en el área de la tecnología.",
    "text-introduction-third": "Después de innumerables horas viendo “Cómo llegar a Marte” en Youtube y un extenso manual en pdf, llegaste a la conclusión de que no sería posible llevar a cabo esta misión solo. Al recordar que su amigo, además de ser un excelente programador, es un entusiasta de Marte, decidió contarle la noticia y pedirle ayuda. Después de muchos desafíos para construir la nave, lo lograste y decidiste que el sistema operativo estaría en Angular. ¡Desde ese momento comienza tu aventura!",
    "text-season-first": "Después de 70 millones de kilómetros recorridos, finalmente entramos en la órbita de Marte, pero luego de atravesar una tormenta geomagnética, tu amigo que estaba a cargo de la nave espacial está inconsciente, ¿y ahora qué? Aún sin saber angular, deberás tomar el mando de la nave, para eso contaremos con la ayuda de nuestra inteligencia artificial (IA), \"bilu\".",
    "close": "cerca",
    "what-is-ternary": "¿Qué es ternario?"
}
