{
    "footer": "© 2022-2022 Angular.com / Todos os direitos reservados.",
    "hello": "Olá",
    "logOut": "sair",
    "logIn": "Entrar",
    "solution": "Solução?",
    "interpolation": "{{ interpolation }}",
    "note": "Nota:",
    "introduction": "Introdução",
    "start": "INÍCIO",
    "back": "voltar",
    "next": "avançar",
    "camouflage": "camuflagem",
    "pressurization": "pressurização",
    "hatch": "escotilha",
    "activated": "ATIVADO",
    "disabled": "DESATIVADO",

    "title-home": "Estude Angular de uma forma divertida",
    "subtitle-first-home": "Chega de cursos, vídeos e artigos chatos.",
    "subtitle-second-home": "Aprenda a codificar de uma maneira nova, divertida e eficaz.",
    "button-play-home": "Jogar & Aprender Angular",
    "button-subtitle-home": "Junte-se a mais de 2 pessoas que começaram a jogar",
    "title-two-problem": "A aprendizagem tradicional tem DOIS GRANDES PROBLEMAS",
    "title-first-problem": "Problema nº 1: Falta de prática",
    "paragraph-one-first-problem": "De acordo com a pesquisa em neurociência, o essencial na aprendizagem é a prática. Quanto mais praticamos, mais eficazmente nosso cérebro armazena as informações aprendidas para acesso posterior. No entanto, o aprendizado tradicional é o oposto da prática.",
    "paragraph-two-first-problem": "Quantas vezes você abriu um editor de código e começou a codificar depois de assistir a outro tutorial de codificação? Provavelmente não o suficiente. Mas o problema não é com você. É a maneira como você aprende.",
    "paragraph-three-first-problem": "Vídeos codificados são projetados para serem consumidos como programas de TV. Como resultado, todas as horas gastas \"aprendendo\" se transformam em horas gastas \"observando a teoria\". E apenas a teoria sem prática leva ao aprendizado improdutivo. Especialmente ao aprender a codificar.",
    "title-second-problem": "Problema nº 2: baixo envolvimento",
    "paragraph-one-second-problem": "De acordo com a pesquisa da neurociência, precisamos garantir que o aprendizado seja envolvente e aproveite o lado emocional do cérebro, por meio do humor, da narrativa e dos jogos. A ênfase no racional e lógico por si só não produz memórias fortes.",
    "paragraph-two-second-problem": "E você se lembra da última vez que assistiu a um tutorial de codificação ou leu um artigo que não era chato? Difícil de lembrar de uma vez, certo? Isso porque a maior parte do conteúdo educacional é entediante.",
    "paragraph-three-second-problem": "O tédio leva à falta de foco e à procrastinação, o que o impede de permanecer engajado e de se lembrar de tudo o que aprendeu.",
    "subtitle-solution": "Combine toneladas de prática com um ambiente envolvente e interativo onde você aprende fazendo.",
    "title-mission": "Nossa missão",
    "subtitle-mission": "Tornando o aprendizado de código mais eficiente, interessante e divertido.",
    "paragraph-one-mission": "Olá, meu nome é Jackson. Sou o fundador do Angular Fantasy. Eu programo há mais de 7 anos e aprendi a codificar usando métodos tradicionais.",
    "paragraph-two-mission": "Eu me lembro daqueles dias. Quantas vezes me forcei a sentar e aprender a programar. Como artigos e documentação me pareciam enfadonhos. O quanto me faltou prática e por causa desse conhecimento rapidamente desapareceu. Aprender não deveria ser assim, então decidi mudar.",
    "paragraph-three-mission": "Comecei com os fundamentos e estudei como nosso cérebro aprende. A neurociência diz que o aprendizado eficaz requer (1) muita prática e (2) um senso de que o aprendizado é envolvente. Exatamente o que costuma ser esquecido nas formas tradicionais de aprendizagem. Exatamente por isso que tive dificuldade em aprender a programar. E exatamente o que precisava ser mudado.",
    "paragraph-four-mission": "Criei Angular Fantasy como uma maneira nova e mais eficiente de aprender código. Os jogos são uma das melhores combinações de (1) prática e (2) um ambiente de aprendizagem envolvente. Eles são o próximo passo lógico da educação tradicional. Eles são o futuro da aprendizagem. E minha missão e missão do Angular Fantasy é fazer desse futuro nossa realidade.",
    "title-fourth-container": "Pronto para começar sua aventura?",

    "paragraph-example-game-home": "Utilize a interpolação escrevendo \"{{ interpolation }}\" no campo abaixo.",
    "paragraph-game-home": "A interpolação de texto permite incorporar valores de string dinâmicos em seus modelos HTML. Use a interpolação para alterar dinamicamente o que aparece em uma visualização do aplicativo, como a exibição de uma saudação personalizada que inclui um \"Olá Mundo\".",

    "season-first": "Primeira temporada",
    "season-second": "Segunda temporada",
    "start-adventure": "Iniciar aventura",
    "text-introduction": "Essa história se passa no ano de 2325, onde as viagens interplanetárias são cada dia mais comuns.",
    "text-introduction-second": "Com a impactante notícia que uma esfera metálica apareceu em Marte, você teve a ideia de construir uma nave para viajar entre os planetas e poder criar conteudos para o seu canal. Parecia loucura, pois para realizar uma viagem interplanetária é necessário muitas horas de estudo e conhecimento na area de tecnologia.",
    "text-introduction-third": "Após inumeras horas assistindo “Como chegar em Marte” no Youtube e um manual extenso em pdf, você chegou a conclusão que não seria possível realizar essa missão sozinho. Ao lembrar que seu amigo além de excelente programador é um entusiasta por Marte resolveu contar sobre a notícia e pedir ajuda. Após muitos desafios para construção da nave vocês conseguiram, e decidiram que o sistema operacional seria em Angular. A partir desse momento sua aventura se inicia!",
    "text-season-first": "Após 70 milhões de quilometros percorridos, finalmente entramos na orbita de marte, porem após passar por uma tempestade geomagnética seu amigo que estava no comando da nave encontra-se desacordado, e agora zé? Mesmo sem saber angular você precisará assumir o comando da nave, para isso vamos contar com ajuda da nossa inteligência artificial (IA), \"bilu\"."
}
